PROJECT.org
#+title: Tarot
#+date: 2024-10-26
#+author: Jordan Bell
#+email: jbell.anthony@gmail.com
#+startup: content

Tarot is quick, but thorough project for dealing with Tarot cards. Using Haskell's powerful type system, we can build a project that effectively describes what Tarot /is/ more than how to use it. It makes for an intuitive way of handling Tarot cards, and is easily extensible.

* Planning
** Tasks
*** DONE Adopt Tarot code into literate source [100%]
**** DONE Adopt minor arcana types into literate source
**** DONE Adopt major arcana types into literate source
**** DONE Refactor minor and major arcana into Tarot type
**** DONE Use TemplateHaskell for creating Uniform instances
**** DONE Adopt Tarot project file into literate source
*** TODO Package Tarot for Guix consumption


* Source
:PROPERTIES:
:header-args: :tangle no :eval no
:END:

For the most part, the pursuit of this project is to attempt a simple project for practicing three major programming styles: Type-Driven Development, Algebra-Driven Development, and Literate Programming. I believe Tarot lends itself well to the first, Org to the last, and Haskell to all three. Still, this is a new venture for me: expect warts ahead, even if only in style.

** Cards
:PROPERTIES:
:header-args: :noweb-ref section_Cards :noweb-sep "\n\n"
:END:

Tarot cards are pretty simple: they're just playing cards at the end of the day. Defining them is easy by using a type-system, more so with the power of Haskell's type system. For that, we can start from the bottom, and define basic value types that we'll use to construct a more complex relationship from later on, especially with respect to randomness. For now, we'll just define the cards.

Under Tarot, there are two systems of cards: minor and major arcana. The minor arcana are closer to the standard playing cards known by most people, while the major arcana are singular, simple concepts. Both lend themselves well to good ol' type calculus, hence the use of Haskell.

*** Minor Arcana
