PROJECT.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-15 Sun 23:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tarot</title>
<meta name="author" content="Jordan Bell" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tarot</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org86566d1">1. Planning</a>
<ul>
<li><a href="#orgbb83513">1.1. Tasks</a>
<ul>
<li><a href="#org1019c8b">1.1.1. <span class="done DONE">DONE</span> Adopt Tarot code into literate source <code>[100%]</code></a></li>
<li><a href="#org7c8fa35">1.1.2. <span class="todo TODO">TODO</span> Package Tarot for Guix consumption</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgaed8521">2. Source</a>
<ul>
<li><a href="#orga635d20">2.1. Cards</a>
<ul>
<li><a href="#org0ed1e6f">2.1.1. Minor Arcana</a></li>
<li><a href="#org6fbff8d">2.1.2. Major Arcana</a></li>
<li><a href="#orgfcd00ce">2.1.3. Tarot Cards</a></li>
</ul>
</li>
<li><a href="#org8a94b6c">2.2. Randomness</a>
<ul>
<li><a href="#org7182993">2.2.1. Individual Cards</a></li>
<li><a href="#org45d3cc6">2.2.2. Lists</a></li>
</ul>
</li>
<li><a href="#org3da6cdb">2.3. Main</a></li>
</ul>
</li>
<li><a href="#org247abf8">3. Afterword</a></li>
</ul>
</div>
</div>
<p>
Tarot is quick, but thorough project for dealing with Tarot cards. Using Haskell&rsquo;s powerful type system, we can build a project that effectively describes what Tarot <i>is</i> more than how to use it. It makes for an intuitive way of handling Tarot cards, and is easily extensible.
</p>
<div id="outline-container-org86566d1" class="outline-2">
<h2 id="org86566d1"><span class="section-number-2">1.</span> Planning</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbb83513" class="outline-3">
<h3 id="orgbb83513"><span class="section-number-3">1.1.</span> Tasks</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org1019c8b" class="outline-4">
<h4 id="org1019c8b"><span class="section-number-4">1.1.1.</span> <span class="done DONE">DONE</span> Adopt Tarot code into literate source <code>[100%]</code></h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org38750bb"></a><span class="done DONE">DONE</span> Adopt minor arcana types into literate source<br /></li>
<li><a id="orgbca1f6e"></a><span class="done DONE">DONE</span> Adopt major arcana types into literate source<br /></li>
<li><a id="org82d627d"></a><span class="done DONE">DONE</span> Refactor minor and major arcana into Tarot type<br /></li>
<li><a id="org01d46ad"></a><span class="done DONE">DONE</span> Use TemplateHaskell for creating Uniform instances<br /></li>
<li><a id="orgabbd956"></a><span class="done DONE">DONE</span> Adopt Tarot project file into literate source<br /></li>
</ol>
</div>
<div id="outline-container-org7c8fa35" class="outline-4">
<h4 id="org7c8fa35"><span class="section-number-4">1.1.2.</span> <span class="todo TODO">TODO</span> Package Tarot for Guix consumption</h4>
</div>
</div>
</div>
<div id="outline-container-orgaed8521" class="outline-2">
<h2 id="orgaed8521"><span class="section-number-2">2.</span> Source</h2>
<div class="outline-text-2" id="text-2">
<p>
For the most part, the pursuit of this project is to attempt a simple project for practicing three major programming styles: Type-Driven Development, Algebra-Driven Development, and Literate Programming. I believe Tarot lends itself well to the first, Org to the last, and Haskell to all three. Still, this is a new venture for me: expect warts ahead, even if only in style.
</p>
</div>
<div id="outline-container-orga635d20" class="outline-3">
<h3 id="orga635d20"><span class="section-number-3">2.1.</span> Cards</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Tarot cards are pretty simple: they&rsquo;re just playing cards at the end of the day. Defining them is easy by using a type-system, more so with the power of Haskell&rsquo;s type system. For that, we can start from the bottom, and define basic value types that we&rsquo;ll use to construct a more complex relationship from later on, especially with respect to randomness. For now, we&rsquo;ll just define the cards.
</p>

<p>
Under Tarot, there are two systems of cards: minor and major arcana. The minor arcana are closer to the standard playing cards known by most people, while the major arcana are singular, simple concepts. Both lend themselves well to good ol&rsquo; type calculus, hence the use of Haskell.
</p>
</div>
