PROJECT.org
**** Ranks
Minor arcana are more-or-less like a standard deck of playing cards, with the only difference from my neck of the woods being that the Jack is replaced by the Paige and Knight. We'll lay them out in one basic sum type called Rank, ordered by ascending value:

#+name: type_Rank_def
#+begin_src haskell
{- | 'Rank' defines the 14 possible ranks of the minor arcana,
 - 10 pip cards and 4 court/face cards.
 -}
data Rank
  = Ace   | Two    | Three | Four | Five
  | Six   | Seven  | Eight | Nine | Ten
  | Paige | Knight | Queen | King
  -- | Ranks are bounded, sequenced, finite, and have uniform distribution.
  -- Deriving these classes allow us to have type-level functions for getting random elements,
  -- a theme we'll repeat with other typeclasses.
  deriving (Bounded, Enum, Eq, Ord, Show, Generic, Finite, Uniform)
#+end_src

If you're familiar with Haskell, you can intuit why we'd derive the basic typeclasses seen here for Ranks:

- Bounded :: Ranks have maximum and minimum values, making them bounded. This will be useful for list comprehensions, where we can rely on the min and max Ranks to set limits for the cards.
- Enum :: Ranks have sequence, so they are enumerable. This will also work well with list comprehensions, but is also *very* important for our randomization.
- Eq :: Ranks can be equal, and checking equality will be necessary for card comparison.
- Ord :: Ranks have increasing value, with ~Two~ being greater than ~One~, also good for card comparison.
- Show :: Displaying a Rank would just show its name, so the *Show* typeclass is a perfect fit.

These are obvious uses, but we should note the power in the combination of *Bounded* and *Enum*: using them together indicates that our type has a floor and ceiling, as well as sequencing. We'll see the power of this in a bit.

The next typeclass, *Generic*, is special: it's used to allow us to morph the values of any given datatype into some values of another typeclass. For our usage, we'll want to do this for the remaining two typeclasses: *Finite* and *Uniform*. We'll also need a special language pragma to use

#+begin_src haskell :noweb-ref pragmas :noweb-sep "\n"
{-# LANGUAGE DeriveAnyClass #-}
#+end_src

to unlock its full power, though; it allows us to make use of all the power of generic programming for our derived random functions.

Speaking of which, *Finite* and *Uniform* are typeclasses provided by the random package under _System.Random.Stateful_, and using it allows us to use type-level shenanigans to handle our random selection of cards. This is where our definitions of *Bounded* and *Enum* come in handy: since we've defined our type such that its both enumerated and bound, we have the minimal required definitions to allow the compiler to derive the necessary functions for *Uniform* and *UniformRange*, typeclasses that will automatically figure out how to randomize our results.

This is because we defined *Rank* in terms that imply uniform and finite distribution, which we can generically derive functions for grabbing random values for. Now that we know the names and meanings, we can look over a simple example:

#+name: ex_Rank_randomness
#+begin_src haskell :eval yes :noweb-ref nil
import System.Random.Stateful

-- Tell the compiler to give us a random value for Rank from rng
uniformM globalStdGen :: IO Rank
#+end_src

#+RESULTS: ex_Rank_randomness
: Eight

**** Suits
Minor arcana also have suits like most basic playing cards, though they are more esoteric. This will follow the same procedure as with Ranks:

#+name: type_Suit
#+begin_src haskell
-- | 'Suit' defines the possible suits for the minor arcana.
data Suit = Wands | Cups | Swords | Pentacles
  deriving (Bounded, Enum, Eq, Show, Generic, Finite, Uniform)
#+end_src

*NOTE:* We've used both *Bounded* and *Enum* here, but not *Ord*. *Ord* is what tells us that one value is greater or lesser than another, which *does not hold for Suits*. They are neither greater or lesser, only equal, and only enumerated / sequential.

*** Major Arcana
The Tarot major arcana are actually simpler than the minor, since they don't have two parts, just one. This will be a simple sum type as well, with some familiar instance definitions as well:

#+name: type_MajorArcana
#+begin_src haskell
-- | 'MajorArcana' defines the 22 major arcana.
data MajorArcana
  = TheFool        | TheMagician | TheHighPriestess | TheEmpress | TheEmperor
  | TheHierophant  | TheLovers   | TheChariot       | Strength   | TheHermit
  | WheelOfFortune | Justice     | TheHangedMan     | Death      | Temperance
  | TheDevil       | TheTower    | TheStar          | TheMoon    | TheSun
  | Judgement      | TheWorld
  deriving (Eq, Enum, Show, Bounded, Generic, Finite, Uniform)
#+end_src

