PROJECT.html
<div id="outline-container-org0ed1e6f" class="outline-4">
<h4 id="org0ed1e6f"><span class="section-number-4">2.1.1.</span> Minor Arcana</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="org31364ed"></a>Ranks<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
Minor arcana are more-or-less like a standard deck of playing cards, with the only difference from my neck of the woods being that the Jack is replaced by the Paige and Knight. We&rsquo;ll lay them out in one basic sum type called Rank, ordered by ascending value:
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="orgfe5e5b0"><span style="color: #9ca0b0; font-style: italic;">{- | 'Rank' defines the 14 possible ranks of the minor arcana,</span>
<span style="color: #9ca0b0; font-style: italic;"> - 10 pip cards and 4 court/face cards.</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #8839ef;">data</span> <span style="color: #df8e1d;">Rank</span>
  <span style="color: #04a5e5;">=</span> <span style="color: #8839ef;">Ace</span>   <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Two</span>    <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Three</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Four</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Five</span>
  <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Six</span>   <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Seven</span>  <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Eight</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Nine</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Ten</span>
  <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Paige</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Knight</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Queen</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">King</span>
  <span style="color: #9ca0b0; font-style: italic;">-- | Ranks are bounded, sequenced, finite, and have uniform distribution.</span>
  <span style="color: #9ca0b0; font-style: italic;">-- Deriving these classes allow us to have type-level functions for getting random elements,</span>
  <span style="color: #9ca0b0; font-style: italic;">-- a theme we'll repeat with other typeclasses.</span>
  <span style="color: #8839ef;">deriving</span> (<span style="color: #8839ef;">Bounded</span>, <span style="color: #8839ef;">Enum</span>, <span style="color: #8839ef;">Eq</span>, <span style="color: #8839ef;">Ord</span>, <span style="color: #8839ef;">Show</span>, <span style="color: #8839ef;">Generic</span>, <span style="color: #8839ef;">Finite</span>, <span style="color: #8839ef;">Uniform</span>)
</pre>
</div>

<p>
If you&rsquo;re familiar with Haskell, you can intuit why we&rsquo;d derive the basic typeclasses seen here for Ranks:
</p>

<dl class="org-dl">
<dt>Bounded</dt><dd>Ranks have maximum and minimum values, making them bounded. This will be useful for list comprehensions, where we can rely on the min and max Ranks to set limits for the cards.</dd>
<dt>Enum</dt><dd>Ranks have sequence, so they are enumerable. This will also work well with list comprehensions, but is also <b>very</b> important for our randomization.</dd>
<dt>Eq</dt><dd>Ranks can be equal, and checking equality will be necessary for card comparison.</dd>
<dt>Ord</dt><dd>Ranks have increasing value, with <code>Two</code> being greater than <code>One</code>, also good for card comparison.</dd>
<dt>Show</dt><dd>Displaying a Rank would just show its name, so the <b>Show</b> typeclass is a perfect fit.</dd>
</dl>

<p>
These are obvious uses, but we should note the power in the combination of <b>Bounded</b> and <b>Enum</b>: using them together indicates that our type has a floor and ceiling, as well as sequencing. We&rsquo;ll see the power of this in a bit.
</p>

<p>
The next typeclass, <b>Generic</b>, is special: it&rsquo;s used to allow us to morph the values of any given datatype into some values of another typeclass. For our usage, we&rsquo;ll want to do this for the remaining two typeclasses: <b>Finite</b> and <b>Uniform</b>. We&rsquo;ll also need a special language pragma to use
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #df8e1d;">{-# LANGUAGE DeriveAnyClass #-}</span>
</pre>
</div>

<p>
to unlock its full power, though; it allows us to make use of all the power of generic programming for our derived random functions.
</p>

<p>
Speaking of which, <b>Finite</b> and <b>Uniform</b> are typeclasses provided by the random package under <span class="underline">System.Random.Stateful</span>, and using it allows us to use type-level shenanigans to handle our random selection of cards. This is where our definitions of <b>Bounded</b> and <b>Enum</b> come in handy: since we&rsquo;ve defined our type such that its both enumerated and bound, we have the minimal required definitions to allow the compiler to derive the necessary functions for <b>Uniform</b> and <b>UniformRange</b>, typeclasses that will automatically figure out how to randomize our results.
</p>

<p>
This is because we defined <b>Rank</b> in terms that imply uniform and finite distribution, which we can generically derive functions for grabbing random values for. Now that we know the names and meanings, we can look over a simple example:
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="orgdf0769a"><span style="color: #8839ef;">import</span> <span style="color: #8839ef;">System.Random.Stateful</span>

<span style="color: #9ca0b0;">-- </span><span style="color: #9ca0b0; font-style: italic;">Tell the compiler to give us a random value for Rank from rng</span>
<span style="color: #1e66f5;">uniformM</span> globalStdGen <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">IO</span> <span style="color: #df8e1d;">Rank</span>
</pre>
</div>
</div>
</li>
<li><a id="org897a643"></a>Suits<br />
<div class="outline-text-5" id="text-2-1-1-2">
<p>
Minor arcana also have suits like most basic playing cards, though they are more esoteric. This will follow the same procedure as with Ranks:
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="org03bf453"><span style="color: #9ca0b0; font-style: italic;">-- | 'Suit' defines the possible suits for the minor arcana.</span>
<span style="color: #8839ef;">data</span> <span style="color: #df8e1d;">Suit</span> <span style="color: #04a5e5;">=</span> <span style="color: #8839ef;">Wands</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Cups</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Swords</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Pentacles</span>
  <span style="color: #8839ef;">deriving</span> (<span style="color: #8839ef;">Bounded</span>, <span style="color: #8839ef;">Enum</span>, <span style="color: #8839ef;">Eq</span>, <span style="color: #8839ef;">Show</span>, <span style="color: #8839ef;">Generic</span>, <span style="color: #8839ef;">Finite</span>, <span style="color: #8839ef;">Uniform</span>)
</pre>
</div>

<p>
<b>NOTE:</b> We&rsquo;ve used both <b>Bounded</b> and <b>Enum</b> here, but not <b>Ord</b>. <b>Ord</b> is what tells us that one value is greater or lesser than another, which <b>does not hold for Suits</b>. They are neither greater or lesser, only equal, and only enumerated / sequential.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org6fbff8d" class="outline-4">
<h4 id="org6fbff8d"><span class="section-number-4">2.1.2.</span> Major Arcana</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
The Tarot major arcana are actually simpler than the minor, since they don&rsquo;t have two parts, just one. This will be a simple sum type as well, with some familiar instance definitions as well:
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="orga3aa11c"><span style="color: #9ca0b0; font-style: italic;">-- | 'MajorArcana' defines the 22 major arcana.</span>
<span style="color: #8839ef;">data</span> <span style="color: #df8e1d;">MajorArcana</span>
  <span style="color: #04a5e5;">=</span> <span style="color: #8839ef;">TheFool</span>        <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheMagician</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheHighPriestess</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheEmpress</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheEmperor</span>
  <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheHierophant</span>  <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheLovers</span>   <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheChariot</span>       <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Strength</span>   <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheHermit</span>
  <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">WheelOfFortune</span> <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Justice</span>     <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheHangedMan</span>     <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Death</span>      <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Temperance</span>
  <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheDevil</span>       <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheTower</span>    <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheStar</span>          <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheMoon</span>    <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheSun</span>
  <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">Judgement</span>      <span style="color: #04a5e5;">|</span> <span style="color: #8839ef;">TheWorld</span>
  <span style="color: #8839ef;">deriving</span> (<span style="color: #8839ef;">Eq</span>, <span style="color: #8839ef;">Enum</span>, <span style="color: #8839ef;">Show</span>, <span style="color: #8839ef;">Bounded</span>, <span style="color: #8839ef;">Generic</span>, <span style="color: #8839ef;">Finite</span>, <span style="color: #8839ef;">Uniform</span>)
</pre>
</div>
</div>
</div>
