PROJECT.org
*** Tarot Cards
With this, we can build constructors for our cards. They have two varieties, major and minor, and we'll construct a new type for holding those values:

#+name: type_Tarot
#+begin_src haskell
{- | 'Tarot' has two kinds, for minor and major arcana, as well as a bool for
 - representing when the card is reversed.
 - 'Minor' has rank, suit, and reversed status.
 - 'Major' has the major arcana and the reversed status.
 -}
data Tarot
  = MinorCard Rank Suit Bool
  | MajorCard MajorArcana Bool
  deriving (Eq, Generic, Finite, Uniform)
#+end_src

This simple part mirrors what we've already done with the rest of our types, but it does lack some of our commonly used typeclasses. We still need to define some rules for *Bounded* and *Enum*, but we can't actually derive the automatically here: the types are no longer basic sum types, but are now product types, and the compiler doesn't know the order they're enumerated or bound in. For that matter, we'll have to define the instance ourselves:

#+name: type_Tarot_instance_Enum
#+begin_src haskell
{- | Enumeration rules for tarot cards:
 - Minor Arcana => 14 Ranks * 4 Suits * 2 Reversed states = 112 values
 - Major Arcana => 22 arcana * 2 Reversed states = 44 values
 - total: 156
 -}
instance Enum Tarot where
  toEnum index
    | index < 0 || 156 <= index = error "Out of bounds for Tarot cards"
    | index < 112 = MinorCard (toEnum rank) (toEnum suit) (toEnum reversed)
    | 112 <= index && index < 134 = MajorCard (toEnum arcana) False
    | otherwise = MajorCard (toEnum arcana) True
    where
      (index', rank) = index `divMod` 14
      (reversed, suit) = index' `divMod` 4
      arcana = (index - 112) `mod` 22

  -- | Shorcut the enumeration for minor and major cards separately to ease the
  -- math burden some.
  fromEnum (MinorCard rank suit reversed)
    = fromEnum rank
    + fromEnum suit * 14
    + fromEnum reversed * 56
  fromEnum (MajorCard arcana reversed)
    = 112
    + fromEnum arcana
    + fromEnum reversed * 22

  -- | Add the canonical boundaries to the enumerate commands to prevent errors
  enumFrom x = enumFromTo x maxBound
  enumFromThen x y = enumFromThenTo x y bound
    where
      bound | fromEnum y >= fromEnum x = maxBound
            | otherwise                = minBound

-- | Set the minimum and maximum bounds to those of the minor and major arcana cards, respectively
instance Bounded Tarot where
  minBound = MinorCard minBound minBound minBound
  maxBound = MajorCard maxBound maxBound
#+end_src

Tarot cards need a special function for the *Show* typeclass. We can construct a simple one based on their actual type names:

#+name: type_Tarot_instance_Show
#+begin_src haskell
-- | Show instance of 'Tarot' for pretty printing.
instance Show Tarot where
  show (MinorCard rank suit False) = show rank ++ " of " ++ show suit
  show (MinorCard rank suit True)  = show rank ++ " of " ++ show suit ++ " (reversed)"
  show (MajorCard arcana isReversed)
    | isReversed = words' (show arcana) ++ " (reversed)"
    | otherwise  = words' (show arcana)
    where
      -- | words' is a helper function that will separate arcana into words
      -- wherever there's a capital letter
      words' [] = []
      words' (capital:rest)
        = (capital : takeWhile isLower rest)
        ++ case dropWhile isLower rest of
            "" -> ""
            nextCapital' -> ' ' : words' nextCapital'
#+end_src

We can see, though, that ~words'~ isn't the standard ~words~ function, and will need the function ~isLower~ from the ~Data.Char~ library, which we'll need to include in our imports with src_haskell[:noweb-ref nil :exports none]{import Data.Char (isLower)}.

With that, here's a demonstration of the typeclass at work:

#+name: test_Tarot_instance_Show
#+begin_src haskell :noweb-ref nil :eval yes :results verbatim
map show [MinorCard Three Wands False, MajorCard TheFool False, MajorCard TheWorld True]
#+end_src

#+RESULTS: test_Tarot_instance_Show
: ["Three of Wands","The Fool","The World (reversed)"]

