PROJECT.org
** Randomness
:PROPERTIES:
:header-args: :noweb-ref section_Random :noweb-sep "\n\n"
:END:

*** Individual Cards

With the structure of the completed, we can return to those strange typeclasses we defined before, *Uniform*. *Uniform* is a "class of types for which a uniformly distributed value can be drawn from all possible values of the type", which pairs well for our card definitions. Using this simple implementation, we can craft some useful functions for import.

First is for getting a random Tarot card. It's actually simpler than fetching other variants, so we'll define it first.

#+name: func_randomTarot
#+begin_src haskell
{- | 'randomTarot' generates a random tarot card, either Minor or Major Arcana,
 - with equal probability. The rank, suit, or card, and orientation (reversed or not)
 - are chosen randomly.
 -}
randomTarot :: IO Tarot
randomTarot = uniformM globalStdGen
#+end_src

Here, we make use of *Uniform*'s ~uniformM~ function; because we defined all the necessary typeclasses to derive *Uniform*, we have easy access to this function which will automatically create a value from an even distribution of all possible values.

In short: when you give a little work to the type-system, it can give a lot more work back to you.

For more specific types of random generation, we can also supply the function ~uniformEnumRM~ with a range. Due to our type-work, we can see these spelled out in the ranges provided:

#+name: func_randomMinorMajorCard
#+begin_src haskell
{- | 'randomMinorCard' generates a random Minor Arcana tarot card,
 - choosing randomly among all possible ranks, suits, and orientations (reversed or not).
 -}
randomMinorCard :: IO Tarot
randomMinorCard = uniformEnumRM (MinorCard minBound minBound minBound, MinorCard maxBound maxBound maxBound) globalStdGen

{- | 'randomMajorCard' generates a random Major Arcana tarot card,
 - choosing randomly among all possible cards and orientations (reversed or not).
 -}
randomMajorCard :: IO Tarot
randomMajorCard = uniformEnumRM (MajorCard minBound minBound, MajorCard maxBound maxBound) globalStdGen
#+end_src

Without using the type-level definitions of randomness, we'd need to implement the same logic within functions explicitly, like so:

#+begin_src haskell :tangle no :noweb-ref nil
-- | Function for returning a random minor card,
-- constructed from random Ranks, Suits, and reversed value.
randomMinorCard :: IO Tarot
randomMinorCard = do
  rank <- randomIO :: IO Rank
  suit <- randomIO :: IO Suit
  isReversed <- randomIO :: IO Bool
  return $ MinorArcana rank suit isReversed
#+end_src

While alright on its own, the application of this type of hand-written logic could build up over time, where as type-magic will work everywhere.

*** Lists
Our use of the *Uniform* typeclass doesn't end in just individual cards. We can use ~uniformListM~ to creates lists of *Uniform* elements, shortcutting the work needed to do tasks like generate a list of cards.

#+name: func_drawCards
#+begin_src haskell
{- | 'drawCards' generates a list of randomly chosen tarot cards.
 - The length of the list is determined by the input argument.
 - This function doesn't care about duplicates; for that, see `drawFromDeck`.
 -}
drawCards :: Int -> IO [Tarot]
drawCards num = uniformListM num globalStdGen
#+end_src

Of course, this isn't the function we'd actually want as our final draw card. For that, we'd want something that pulls uniformly from the list of cards, but also doesn't create duplicates. For our part, we can do this by using a full, standard list of cards, then just shuffling it a bit.

First, our shuffle function, which will work rather simply by just moving cards about. Relatively expensive, I believe, but good enough to get the job done while maintaining exactly what we need: a randomizer that pays attention to the cards that have been dealt.

#+name: func_shuffle
#+begin_src haskell
{- | 'shuffle' is a naive implementation of a shuffling function for a list.
 - It takes the input list and "cuts" it at random points, adding it to the end.
 - It does this for the lenght of the list.
 -}
shuffle :: [a] -> IO [a]
shuffle []  = return []
shuffle [x] = return [x]
shuffle xs = do
    i <- randomRIO (0, length xs - 1)
    let (ys, zs) = splitAt i xs
    rest <- shuffle (ys ++ drop 1 zs)
    return $ (xs !! i) : rest
#+end_src

From here, we have some simple work to get this to shuffle a full list of cards, and deal them out as needed. It has some simple checks to ensure we don't pull more cards than are possible or less than we're capable.

#+name: func_drawFromDeck
#+begin_src haskell
{- | `drawFromDeck` generates a list of tarot cards as if drawn from a deck.
 - It creates a list of all possible cards, then `shuffle`s the list.
 - The input is the number of cards to draw from this deck.
 - The function produces an error on invalid inputs:
 -   1) an input greater than the size of the deck of all possible cards
 -   2) a number less than 1
 -}
drawFromDeck :: Int -> IO (Either String [Tarot])
drawFromDeck n
  | n < 0 = return $ Left "Cannot draw a negative number of cards"
  | n > length fullDeck = return $ Left "Cannot draw more cards than the size of the deck"
  | otherwise = do
      shuffledDeck <- shuffle fullDeck
      return $ Right $ take n shuffledDeck
  where
    fullDeck = enumFrom minBound :: [Tarot]
#+end_src

