PROJECT.html

<span style="color: #9ca0b0; font-style: italic;">{- | 'randomTarot' generates a random tarot card, either Minor or Major Arcana,</span>
<span style="color: #9ca0b0; font-style: italic;"> - with equal probability. The rank, suit, or card, and orientation (reversed or not)</span>
<span style="color: #9ca0b0; font-style: italic;"> - are chosen randomly.</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #1e66f5;">randomTarot</span> <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">IO</span> <span style="color: #df8e1d;">Tarot</span>
<span style="color: #1e66f5;">randomTarot</span> <span style="color: #04a5e5;">=</span> uniformM globalStdGen

<span style="color: #9ca0b0; font-style: italic;">{- | 'randomMinorCard' generates a random Minor Arcana tarot card,</span>
<span style="color: #9ca0b0; font-style: italic;"> - choosing randomly among all possible ranks, suits, and orientations (reversed or not).</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #1e66f5;">randomMinorCard</span> <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">IO</span> <span style="color: #df8e1d;">Tarot</span>
<span style="color: #1e66f5;">randomMinorCard</span> <span style="color: #04a5e5;">=</span> uniformEnumRM (<span style="color: #8839ef;">MinorCard</span> minBound minBound minBound, <span style="color: #8839ef;">MinorCard</span> maxBound maxBound maxBound) globalStdGen

<span style="color: #9ca0b0; font-style: italic;">{- | 'randomMajorCard' generates a random Major Arcana tarot card,</span>
<span style="color: #9ca0b0; font-style: italic;"> - choosing randomly among all possible cards and orientations (reversed or not).</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #1e66f5;">randomMajorCard</span> <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">IO</span> <span style="color: #df8e1d;">Tarot</span>
<span style="color: #1e66f5;">randomMajorCard</span> <span style="color: #04a5e5;">=</span> uniformEnumRM (<span style="color: #8839ef;">MajorCard</span> minBound minBound, <span style="color: #8839ef;">MajorCard</span> maxBound maxBound) globalStdGen

<span style="color: #9ca0b0; font-style: italic;">{- | 'drawCards' generates a list of randomly chosen tarot cards.</span>
<span style="color: #9ca0b0; font-style: italic;"> - The length of the list is determined by the input argument.</span>
<span style="color: #9ca0b0; font-style: italic;"> - This function doesn't care about duplicates; for that, see `drawFromDeck`.</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #1e66f5;">drawCards</span> <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">Int</span> <span style="color: #04a5e5;">-&gt;</span> <span style="color: #df8e1d;">IO</span> [<span style="color: #df8e1d;">Tarot</span>]
<span style="color: #1e66f5;">drawCards</span> num <span style="color: #04a5e5;">=</span> uniformListM num globalStdGen

<span style="color: #9ca0b0; font-style: italic;">{- | 'shuffle' is a naive implementation of a shuffling function for a list.</span>
<span style="color: #9ca0b0; font-style: italic;"> - It takes the input list and "cuts" it at random points, adding it to the end.</span>
<span style="color: #9ca0b0; font-style: italic;"> - It does this for the lenght of the list.</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #1e66f5;">shuffle</span> <span style="color: #04a5e5;">::</span> [a] <span style="color: #04a5e5;">-&gt;</span> <span style="color: #df8e1d;">IO</span> [a]
<span style="color: #1e66f5;">shuffle</span> <span style="color: #8839ef;">[]</span>  <span style="color: #04a5e5;">=</span> return <span style="color: #8839ef;">[]</span>
<span style="color: #1e66f5;">shuffle</span> [x] <span style="color: #04a5e5;">=</span> return [x]
<span style="color: #1e66f5;">shuffle</span> xs <span style="color: #04a5e5;">=</span> <span style="color: #8839ef;">do</span>
    i <span style="color: #04a5e5;">&lt;-</span> randomRIO (<span style="color: #fe640b;">0</span>, length xs <span style="color: #04a5e5;">-</span> <span style="color: #fe640b;">1</span>)
    <span style="color: #8839ef;">let</span> (ys, zs) <span style="color: #04a5e5;">=</span> splitAt i xs
    rest <span style="color: #04a5e5;">&lt;-</span> shuffle (ys <span style="color: #04a5e5;">++</span> drop <span style="color: #fe640b;">1</span> zs)
    return <span style="color: #04a5e5;">$</span> (xs <span style="color: #04a5e5;">!!</span> i) <span style="color: #8839ef;">:</span> rest

<span style="color: #9ca0b0; font-style: italic;">{- | `drawFromDeck` generates a list of tarot cards as if drawn from a deck.</span>
<span style="color: #9ca0b0; font-style: italic;"> - It creates a list of all possible cards, then `shuffle`s the list.</span>
<span style="color: #9ca0b0; font-style: italic;"> - The input is the number of cards to draw from this deck.</span>
<span style="color: #9ca0b0; font-style: italic;"> - The function produces an error on invalid inputs:</span>
<span style="color: #9ca0b0; font-style: italic;"> -   1) an input greater than the size of the deck of all possible cards</span>
<span style="color: #9ca0b0; font-style: italic;"> -   2) a number less than 1</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #1e66f5;">drawFromDeck</span> <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">Int</span> <span style="color: #04a5e5;">-&gt;</span> <span style="color: #df8e1d;">IO</span> (<span style="color: #df8e1d;">Either</span> <span style="color: #df8e1d;">String</span> [<span style="color: #df8e1d;">Tarot</span>])
<span style="color: #1e66f5;">drawFromDeck</span> n
  <span style="color: #04a5e5;">|</span> n <span style="color: #04a5e5;">&lt;</span> <span style="color: #fe640b;">0</span> <span style="color: #04a5e5;">=</span> return <span style="color: #04a5e5;">$</span> <span style="color: #8839ef;">Left</span> <span style="color: #40a02b;">"Cannot draw a negative number of cards"</span>
  <span style="color: #04a5e5;">|</span> n <span style="color: #04a5e5;">&gt;</span> length fullDeck <span style="color: #04a5e5;">=</span> return <span style="color: #04a5e5;">$</span> <span style="color: #8839ef;">Left</span> <span style="color: #40a02b;">"Cannot draw more cards than the size of the deck"</span>
  <span style="color: #04a5e5;">|</span> otherwise <span style="color: #04a5e5;">=</span> <span style="color: #8839ef;">do</span>
      shuffledDeck <span style="color: #04a5e5;">&lt;-</span> shuffle fullDeck
      return <span style="color: #04a5e5;">$</span> <span style="color: #8839ef;">Right</span> <span style="color: #04a5e5;">$</span> take n shuffledDeck
  <span style="color: #8839ef;">where</span>
    fullDeck <span style="color: #04a5e5;">=</span> enumFrom minBound <span style="color: #04a5e5;">::</span> [<span style="color: #df8e1d;">Tarot</span>]
