PROJECT.org
** Main
Now that all the major work is done, we have some basic scaffolding to do. We'll make us of the ~OverloadedStrings~ pragma, since we don't really want to think about them, and do some importing for necessary functions here as well.

#+name: Tarot_preamble
#+begin_src haskell :tangle ./Tarot.hs :noweb yes
{-# LANGUAGE OverloadedStrings #-}
<<pragmas>>

module Main
  ( drawFromDeck
  , Rank(..)
  , Suit(..)
  , MajorArcana(..)
  , Tarot(..)
  , randomMinorCard
  , randomMajorCard
  , randomTarot
  , main
  ) where

import Data.Char     (isLower)
import System.IO     (hFlush,stdout)
import System.Random.Stateful
import GHC.Generics  (Generic)

<<section_Cards>>

<<section_Random>>

<<Tarot_main>>
#+end_src

Last but not least, we have the actual main entry into the program, the CLI, and a little housekeeping function to keep our output clean.

#+name: Tarot_main
#+begin_src haskell
{- | 'ordinal' takes an integer and returns its ordinal representation as a string.
 - For example, 'ordinal 3' returns "3rd".
 -}
ordinal :: Int -> String
ordinal 11 = "11th"
ordinal 12 = "12th"
ordinal 13 = "13th"
ordinal index = show index ++ case (last $ show index) of
  '1' -> "st"
  '2' -> "nd"
  '3' -> "rd"
  _   -> "th"

{- | The 'main' function prompts the user for a number of cards to draw,
 - then generates and prints that many random tarot cards.
 - Each card is printed with its position in the draw (1st, 2nd, etc.) and its details.
 -}
main :: IO ()
main = do
  putStr "How many cards shall I draw? "
  hFlush stdout
  numberOfCards <- readLn :: IO Int
  result <- drawFromDeck numberOfCards
  case result of
    Left err    -> putStrLn $ "Error: " ++ err
    Right cards -> mapM_ printOrderCard $ zip [1..] cards
  where
    printOrderCard (index,card) = putStrLn $ ordinal index ++ ": " ++ show card
#+end_src

And that's it! The program can be called and ran from CLI, and will run simply draw the number of cards requested.

#+begin_example
$ tarot
How many cards shall I draw? 3
1st: Nine of Swords (reversed)
2nd: Ten of Cups
3rd: Ace of Wands
#+end_example



* Afterword
This was a tiny project to explore making use of two particular paradigms I'm not used to: Literate Programming, and Type-Driven Development. I find both ideas fascinating, but have been struggling to actually find time or try to actually make use of them, so I've forced myself to write out a common idea in Haskell using LP and T(ype)DD, and I believe it's mostly effective. I'll say that the biggest issues I faced were adjusting to learning how to write out my ideas as I include the code into the project, and how best to work with types at the forefront and not as an afterthought.

The literate part of Literate Programming was harder than I expected. Not because of documenting the code as I expected it would (it came more naturally than I expected to include code in the docs and the literate source), but because of the context changing between them. I found myself moving away from the more standard cycle of Experiment => Find Failure => Experiment => Find Success => Commit, to instead reasoning more about what exactly I was attempting to write and why, and how to make that reality simple enough for consumption in the literate source. Maybe this was just part of creating a project that might see the light of day off of my SSD for the first time, or maybe it was the result of actually following the Literate Programming ideals and hitting the natural strides of trying to explain the reasoning /as you're writing it/.

Either way, I feel better about Literate Programming as a result. It's definitely more cumbersome than just loading up a source file and editing it, but I feel more agile about it with practice, and I do believe that the extra effort may be worth it. Not totally proven correct there, yet, but we'll see.

As for Type-Driven Development, I still feel like I've made some mistakes here, moreso than just with the LP part of the project. The cumbersome way that *Uniform* is attached to the typeclasses by deriving *Generic* feels heavy, even if its just a library import, and the fact that I don't use it's power in the main function (~drawFromDeck~) feels like I've missed something. Worse yet, I'm not sure if this was the wrong decision: I /prefer/ using *Uniform* over manually writing out the randomness logic, and I believe it's due to wanting to incorporate more type logic, not less.

With that in mind, I think I should focus more on types in the future as Haskell incorporates more features on Dependent Types, just to be able to use them more effectively.

Glad to have actually written this project, by these measures. Worth learning, though we'll see if I actually ever publish this anywhere.
