PROJECT.html

<span style="color: #9ca0b0; font-style: italic;">{- | 'ordinal' takes an integer and returns its ordinal representation as a string.</span>
<span style="color: #9ca0b0; font-style: italic;"> - For example, 'ordinal 3' returns "3rd".</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #1e66f5;">ordinal</span> <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">Int</span> <span style="color: #04a5e5;">-&gt;</span> <span style="color: #df8e1d;">String</span>
<span style="color: #1e66f5;">ordinal</span> <span style="color: #fe640b;">11</span> <span style="color: #04a5e5;">=</span> <span style="color: #40a02b;">"11th"</span>
<span style="color: #1e66f5;">ordinal</span> <span style="color: #fe640b;">12</span> <span style="color: #04a5e5;">=</span> <span style="color: #40a02b;">"12th"</span>
<span style="color: #1e66f5;">ordinal</span> <span style="color: #fe640b;">13</span> <span style="color: #04a5e5;">=</span> <span style="color: #40a02b;">"13th"</span>
<span style="color: #1e66f5;">ordinal</span> index <span style="color: #04a5e5;">=</span> show index <span style="color: #04a5e5;">++</span> <span style="color: #8839ef;">case</span> (last <span style="color: #04a5e5;">$</span> show index) <span style="color: #8839ef;">of</span>
  <span style="color: #40a02b;">'1'</span> <span style="color: #04a5e5;">-&gt;</span> <span style="color: #40a02b;">"st"</span>
  <span style="color: #40a02b;">'2'</span> <span style="color: #04a5e5;">-&gt;</span> <span style="color: #40a02b;">"nd"</span>
  <span style="color: #40a02b;">'3'</span> <span style="color: #04a5e5;">-&gt;</span> <span style="color: #40a02b;">"rd"</span>
  <span style="color: #8839ef;">_</span>   <span style="color: #04a5e5;">-&gt;</span> <span style="color: #40a02b;">"th"</span>

<span style="color: #9ca0b0; font-style: italic;">{- | The 'main' function prompts the user for a number of cards to draw,</span>
<span style="color: #9ca0b0; font-style: italic;"> - then generates and prints that many random tarot cards.</span>
<span style="color: #9ca0b0; font-style: italic;"> - Each card is printed with its position in the draw (1st, 2nd, etc.) and its details.</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #1e66f5;">main</span> <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">IO</span> <span style="color: #8839ef;">()</span>
<span style="color: #1e66f5;">main</span> <span style="color: #04a5e5;">=</span> <span style="color: #8839ef;">do</span>
  putStr <span style="color: #40a02b;">"How many cards shall I draw? "</span>
  hFlush stdout
  numberOfCards <span style="color: #04a5e5;">&lt;-</span> readLn <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">IO</span> <span style="color: #df8e1d;">Int</span>
  cards <span style="color: #04a5e5;">&lt;-</span> drawCards numberOfCards
  mapM_ printOrderCard <span style="color: #04a5e5;">$</span> zip [<span style="color: #fe640b;">1</span><span style="color: #04a5e5;">..</span>] cards
  <span style="color: #8839ef;">where</span>
    printOrderCard (index,card) <span style="color: #04a5e5;">=</span> putStrLn <span style="color: #04a5e5;">$</span> ordinal index <span style="color: #04a5e5;">++</span> <span style="color: #40a02b;">": "</span> <span style="color: #04a5e5;">++</span> show card
</pre>
</div>

<p>
Last but not least, we have the actual main entry into the program, the CLI, and a little housekeeping function to keep our output clean.
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="org5b46f58"><span style="color: #9ca0b0; font-style: italic;">{- | 'ordinal' takes an integer and returns its ordinal representation as a string.</span>
<span style="color: #9ca0b0; font-style: italic;"> - For example, 'ordinal 3' returns "3rd".</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #1e66f5;">ordinal</span> <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">Int</span> <span style="color: #04a5e5;">-&gt;</span> <span style="color: #df8e1d;">String</span>
<span style="color: #1e66f5;">ordinal</span> <span style="color: #fe640b;">11</span> <span style="color: #04a5e5;">=</span> <span style="color: #40a02b;">"11th"</span>
<span style="color: #1e66f5;">ordinal</span> <span style="color: #fe640b;">12</span> <span style="color: #04a5e5;">=</span> <span style="color: #40a02b;">"12th"</span>
<span style="color: #1e66f5;">ordinal</span> <span style="color: #fe640b;">13</span> <span style="color: #04a5e5;">=</span> <span style="color: #40a02b;">"13th"</span>
<span style="color: #1e66f5;">ordinal</span> index <span style="color: #04a5e5;">=</span> show index <span style="color: #04a5e5;">++</span> <span style="color: #8839ef;">case</span> (last <span style="color: #04a5e5;">$</span> show index) <span style="color: #8839ef;">of</span>
  <span style="color: #40a02b;">'1'</span> <span style="color: #04a5e5;">-&gt;</span> <span style="color: #40a02b;">"st"</span>
  <span style="color: #40a02b;">'2'</span> <span style="color: #04a5e5;">-&gt;</span> <span style="color: #40a02b;">"nd"</span>
  <span style="color: #40a02b;">'3'</span> <span style="color: #04a5e5;">-&gt;</span> <span style="color: #40a02b;">"rd"</span>
  <span style="color: #8839ef;">_</span>   <span style="color: #04a5e5;">-&gt;</span> <span style="color: #40a02b;">"th"</span>

<span style="color: #9ca0b0; font-style: italic;">{- | The 'main' function prompts the user for a number of cards to draw,</span>
<span style="color: #9ca0b0; font-style: italic;"> - then generates and prints that many random tarot cards.</span>
<span style="color: #9ca0b0; font-style: italic;"> - Each card is printed with its position in the draw (1st, 2nd, etc.) and its details.</span>
<span style="color: #9ca0b0; font-style: italic;"> -}</span>
<span style="color: #1e66f5;">main</span> <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">IO</span> <span style="color: #8839ef;">()</span>
<span style="color: #1e66f5;">main</span> <span style="color: #04a5e5;">=</span> <span style="color: #8839ef;">do</span>
  putStr <span style="color: #40a02b;">"How many cards shall I draw? "</span>
  hFlush stdout
  numberOfCards <span style="color: #04a5e5;">&lt;-</span> readLn <span style="color: #04a5e5;">::</span> <span style="color: #df8e1d;">IO</span> <span style="color: #df8e1d;">Int</span>
  cards <span style="color: #04a5e5;">&lt;-</span> drawCards numberOfCards
  mapM_ printOrderCard <span style="color: #04a5e5;">$</span> zip [<span style="color: #fe640b;">1</span><span style="color: #04a5e5;">..</span>] cards
  <span style="color: #8839ef;">where</span>
    printOrderCard (index,card) <span style="color: #04a5e5;">=</span> putStrLn <span style="color: #04a5e5;">$</span> ordinal index <span style="color: #04a5e5;">++</span> <span style="color: #40a02b;">": "</span> <span style="color: #04a5e5;">++</span> show card
</pre>
</div>

<p>
And that&rsquo;s it! The program can be called and ran from CLI, and will run simply draw the number of cards requested.
</p>

<pre class="example" id="org32d6b8d">
$ tarot
How many cards shall I draw? 3
1st: Nine of Swords (reversed)
2nd: Ten of Cups
3rd: Ace of Wands
</pre>
</div>
</div>
</div>
<div id="outline-container-org247abf8" class="outline-2">
<h2 id="org247abf8"><span class="section-number-2">3.</span> Afterword</h2>
<div class="outline-text-2" id="text-3">
<p>
This was a tiny project to explore making use of two particular paradigms I&rsquo;m not used to: Literate Programming, and Type-Driven Development. I find both ideas fascinating, but have been struggling to actually find time or try to actually make use of them, so I&rsquo;ve forced myself to write out a common idea in Haskell using LP and T(ype)DD, and I believe it&rsquo;s mostly effective. I&rsquo;ll say that the biggest issues I faced were adjusting to learning how to write out my ideas as I include the code into the project, and how best to work with types at the forefront and not as an afterthought.
</p>

<p>
The literate part of Literate Programming was harder than I expected. Not because of documenting the code as I expected it would (it came more naturally than I expected to include code in the docs and the literate source), but because of the context changing between them. I found myself moving away from the more standard cycle of Experiment =&gt; Find Failure =&gt; Experiment =&gt; Find Success =&gt; Commit, to instead reasoning more about what exactly I was attempting to write and why, and how to make that reality simple enough for consumption in the literate source. Maybe this was just part of creating a project that might see the light of day off of my SSD for the first time, or maybe it was the result of actually following the Literate Programming ideals and hitting the natural strides of trying to explain the reasoning <i>as you&rsquo;re writing it</i>.
</p>

<p>
Either way, I feel better about Literate Programming as a result. It&rsquo;s definitely more cumbersome than just loading up a source file and editing it, but I feel more agile about it with practice, and I do believe that the extra effort may be worth it. Not totally proven correct there, yet, but we&rsquo;ll see.
</p>

<p>
As for Type-Driven Development, I still feel like I&rsquo;ve made some mistakes here, moreso than just with the LP part of the project. The cumbersome way that <b>Uniform</b> is attached to the typeclasses by deriving <b>Generic</b> feels heavy, even if its just a library import, and the fact that I don&rsquo;t use it&rsquo;s power in the main function (<code>drawFromDeck</code>) feels like I&rsquo;ve missed something. Worse yet, I&rsquo;m not sure if this was the wrong decision: I <i>prefer</i> using <b>Uniform</b> over manually writing out the randomness logic, and I believe it&rsquo;s due to wanting to incorporate more type logic, not less.
</p>

<p>
With that in mind, I think I should focus more on types in the future as Haskell incorporates more features on Dependent Types, just to be able to use them more effectively.
</p>

<p>
Glad to have actually written this project, by these measures. Worth learning, though we&rsquo;ll see if I actually ever publish this anywhere.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-10-26</p>
<p class="author">Author: Jordan Bell</p>
<p class="date">Created: 2024-12-15 Sun 23:55</p>
</div>
</body>
</html>
